
from core.data.icons import LabIco, OtherIco, CorpIco, Marryico, Notes

import textwrap as tw

tricks_cm = {
    'start': {
        'menu': tw.dedent("""
            <b>💚 Не идентифицируемый объект замечен!</b>
            
            <i>📖 Перед началом твоего путешествия, <b><a href='https://teletype.in/@epidemic_gamebot/guide_epidemic'>прочитай гайд по игре</a></b></i>
            <i>
            ✨ Красивый чатик на безопасной планете,
            твои глазки засияют от увиденного <b><a href='https://t.me/biowars_chat'>Посетив чат игры</a></b>
            а также не забудь <b><a href='https://t.me/biowars_new'>Посетить канал игры с квестами</a></b>
            </i>
            <b>📞 Комиссия поддержки Эпсилон</b>
            <b>> 🌐 Онлайн
                t.me/m_thousand_m / t.me/stvvvolk05 </b>
            {}
            
            <i>В добрый путь играющий свою роль за ученого или вируса!</i>
            """),
        'menu_admin_list': {},
        
        'bot_pm': '📩 Личка бота открыта <b><a href="https://t.me/epidemic2_bot">здесь</a></b>',
        'bot_pm_cmd': '📩 Личка бота с командой <a href="https://t.me/epidemic2_bot?text={}">{}</a> открыта'
    },
    'rp': {
        'погладить': [
            '⌈ 🎀 ⌋ <b>{}<i> Погладил(a) </i>{}</b>',
            '⌈ 💝 ⌋ <b>{}<i> Слегка касаясь макушки, начинает гладить </i>{}</b>',
            '⌈ 🌸 ⌋ <b>{}<i> Проводит ладонью по голове и гладит </i>{}</b>',
            '⌈ 🫶 ⌋ <b>{}<i> Нежно провел(-а) рукой по волосам, поглаживая </i>{}</b>'
        ],
        'обнять': [
            '⌈ 🌸 ⌋ <b>{}<i> Обнял(а) </i>{}</b>',
            '⌈ 🤗 ⌋ <b>{}<i> Притянул(а) к себе и крепко обнял(а) </i>{}</b>',
            '⌈ 🌸 ⌋ <b>{}<i> Нежно обнял(а), прижимая к себе </i>{}</b>',
            '⌈ 💞 ⌋ <b>{}<i> Обнял(а) с теплом, склонив голову на плечо </i>{}</b>',
            '⌈ 🧣 ⌋ <b>{}<i> Завернул(а) в свои объятия, как в уютное одеяло </i>{}</b>',
            '⌈ 🤗 ⌋ <b>{}<i> Подошла(шёл) со спины, приобнял(а) </i>{}</b>',
            '⌈ 🎀 ⌋ <b>{}<i> Обнял(а) так крепко, что аж ребра захрустели у </i>{}</b>',
        ],
        'кусь': [
            '⌈ 👀 ⌋ <b>{}<i> Укусил(а) </i>{}</b>',
            '⌈ 😋 ⌋ <b>{}<i> Слегка укусил(а) </i>{}</b>',
            '⌈ 😜 ⌋ <b>{}<i> Вцепился(ась) зубами и укусил(а) </i>{}</b>',
            '⌈ 🍴 ⌋ <b>{}<i> Шутливо укусил(-а) за палец, притворяясь голодным(-ой) </i>{}</b>',
            '⌈ 😝 ⌋ <b>{}<i> Сделал(а) небольшой кусь </i>{}</b>',
            '⌈ 👀 ⌋ <b>{}<i> Кусьнул(а) </i>{}</b>',
        ],
        'укусить': [
            '⌈ 👀 ⌋ <b>{}<i> Укусил(а) </i>{}</b>',
            '⌈ 😋 ⌋ <b>{}<i> Слегка укусил(а) </i>{}</b>',
            '⌈ 😜 ⌋ <b>{}<i> Вцепился(ась) зубами и укусил(а) </i>{}</b>',
            '⌈ 🍴 ⌋ <b>{}<i> Шутливо укусил(-а) за палец, притворяясь голодным(-ой) </i>{}</b>',
            '⌈ 😝 ⌋ <b>{}<i> Сделал(а) небольшой кусь </i>{}</b>',
            '⌈ 👀 ⌋ <b>{}<i> Кусьнул(а) </i>{}</b>',
        ],
        'поцеловать': [
            '⌈ 💕 ⌋ <b>{}<i> Поцеловал(а) </i>{}</b>',
            '⌈ 💋 ⌋ <b>{}<i> Оставил(-а) нежный поцелуй  </i>{}</b>',
            '⌈ ❤️‍🔥 ⌋ <b>{}<i> Нежно поцеловал(а) в губы </i>{}</b>',
            '⌈ 💕 ⌋ <b>{}<i> Страстно поцеловал(а) </i>{}</b>',
            '⌈ 🌸 ⌋ <b>{}<i> Нежно коснулся(-ась) губами щеки, оставив поцелуй </i>{}</b>',
            '⌈ 🌙 ⌋ <b>{}<i> Коснулся(-ась) губами , оставляя лёгкий след поцелуя </i>{}</b>',
            '⌈ 💋 ⌋ <b>{}<i> Подарил(а) воздушный поцелуй </i>{}</b>',
        ],
        'раб': [
            '⌈ 🛐 ⌋ <b>{}<i> Взял(а) в рабство </i>{}</b>',
            '⌈ 🧎‍♂️ ⌋ <b>{}<i> Взял(-а) в вечное подчинение </i>{}</b>',
            '⌈ 🛐 ⌋ <b>{}<i> Сделал(а) своим рабом </i>{}</b>',
            '⌈ 🧎‍♂️ ⌋ <b>{}<i> Заставил(а) работать на себя </i>{}</b>',
        ],
        'бутылка': [
            '⌈ 🍾 ⌋ <b>{}<i> Посадил(а) на бутылку </i>{}</b>',
            '⌈ 😈 ⌋ <b>{}<i> Насильно посадил на бутылку </i>{}</b>',
            '⌈ 😤 ⌋ <b>{}<i> Достал(а) бутылку и засунул(а) в </i>{}</b>',
            '⌈ 🍾 ⌋ <b>{}<i> Кинул(а) бутылку в </i>{}</b>',
        ],
        'потискать': [
            '⌈ 💞 ⌋ <b>{}<i> потискал(а) </i>{}</b>',
            '⌈ 🐻 ⌋ <b>{}<i> Потискал(а) от души  </i>{}</b>',
            '⌈ 😊 ⌋ <b>{}<i> Игриво потискал(а) за щёчки, не скрывая восторга </i>{}</b>',
        ],
        'соль': [
            '⌈ 🧂 ⌋ <b>{}<i> Подарил(а) пакет соли </i>{}</b>',
            '⌈ 🧂 ⌋ <b>{}<i> Преподнес(ла) пачку соли </i>{}</b>',
            '⌈ 💰 ⌋ <b>{}<i> Дал(а) мешочек с солью </i>{}</b>',
            '⌈ 😵‍💫 ⌋ <b>{}<i> Употребил(а) соль от </i>{}</b>',
        ],
        'вахуи': [
            '⌈ 😱 ⌋ <b>{}<i> в шоке от инфы </i>{}</b>',
            '⌈ 🤯 ⌋ <b>{}<i> Привел(а) в полное удивление </i>{}</b>',
            '⌈ 😲 ⌋ <b>{}<i> Ввел(а) в недоумение информацией </i>{}</b>',
        ],
        'сжечь': [
            '⌈ 🔥 ⌋ <b>{}<i> Испепелил(а) до тла  </i>{}</b>',
            '⌈ 🔥 ⌋ <b>{}<i> Испепелил(а) до последней искры </i>{}</b>',
        ],
        'убить': [
            '⌈ 🔪 ⌋ <b>{}<i> Убил(а) </i>{}</b>',
            '⌈ ☠️ ⌋ <b>{}<i> Хладнокровно убил(а) </i>{}</b>',
            '⌈ 🩸 ⌋ <b>{}<i> Медленно и с  удовольствием довёл(а) дело до конца, убив </i>{}</b>',
            '⌈ ⚔️ ⌋ <b>{}<i> Резко нанёс(ла) смертельный удар, не оставив шанса на спасение </i>{}</b>',
        ],
        'трахнуть': [
            '⌈ 🫦 ⌋ <b>{}<i> Трахнул(а) </i>{}</b>',
            '⌈ 🔥 ⌋ <b>{}<i> Охваченный(ая) страстью, смачно выебал(а) </i>{}</b>',
            '⌈ 💄 ⌋ <b>{}<i> Резко нагнул(а) и трахнул(а) </i>{}</b>',
        ],
        'выебать': [
            '⌈ 🫦 ⌋ <b>{}<i> Трахнул(а) </i>{}</b>',
            '⌈ 🔥 ⌋ <b>{}<i> Охваченный(ая) страстью, смачно выебал(а) </i>{}</b>',
            '⌈ 💄 ⌋ <b>{}<i> Резко нагнул(а) и трахнул(а) </i>{}</b>',
        ],
        'покормить': [
            '⌈ 🥪 ⌋ <b>{}<i> Покормил(а) </i>{}</b>',
            '⌈ 🍰 ⌋ <b>{}<i> Заботливо покормил(а) </i>{}</b>',
            '⌈ 🍲 ⌋ <b>{}<i> Поднёс(ла) ложку ко рту, кормя вкусной едой </i>{}</b>',
            '⌈ 🍫 ⌋ <b>{}<i> Угостил(а) едой </i>{}</b>',
        ],
        'дать пять': [
            '⌈ 🖐 ⌋ <b>{}<i> Дал(а) пять </i>{}</b>',
            '⌈ 🫸 ⌋ <b>{}<i> Громко хлопнул(-а) по ладони, давая пять </i>{}</b>',
            '⌈ ✋ ⌋ <b>{}<i> Весело дал(а) пять </i>{}</b>',
            '⌈ 🙏 ⌋ <b>{}<i> Обменялся(ась) пятюнями с </i>{}</b>',
        ],
        'извиниться': [
            '⌈ 😬 ⌋ <b>{}<i> Извинился(ась) перед </i>{}</b>',
            '⌈ 😔 ⌋ <b>{}<i> Искренне извинился(ась) у ног </i>{}</b>',
            '⌈ 🥺 ⌋ <b>{}<i> Попросил(а) прощения у </i>{}</b>',
            '⌈ 😣 ⌋ <b>{}<i> Опустил(а) голову в знак раскаяния и попросил(а) прощения у </i>{}</b>',
        ],
        'кастрировать': [
            '⌈ ✂️ ⌋ <b>{}<i> Кастрировал(а) </i>{}</b>',
            '⌈ ✂️ ⌋ <b>{}<i> Безжалостно кастрировал(а) </i>{}</b>',
            '⌈  🫥⌋ <b>{}<i> Лишил(а) достоинства </i>{}</b>',
            '⌈ 🗡 ⌋ <b>{}<i> Отрезал(а) достоинство у </i>{}</b>',
        ],
        'лизнуть': [
            '⌈ 👅 ⌋ <b>{}<i> Лизнул(а) </i>{}</b>',
            '⌈ 😜 ⌋ <b>{}<i> Облизал(а) с ног до головы </i>{}</b>',
            '⌈ 👄 ⌋ <b>{}<i> Игриво лизнул(а) </i>{}</b>',
        ],
        'поздравить': [
            '⌈ 🎊 ⌋ <b>{}<i> Поздравил(а) </i>{}</b>',
            '⌈ 🎉 ⌋ <b>{}<i> Тепло сказал(а) пару слов для поздравления </i>{}</b>',
            '⌈ 🥳 ⌋ <b>{}<i> С широкой улыбкой поздравил(а), искренне радуясь за </i>{}</b>',
        ],
        'рукопожатие': [
            '⌈ 🤝 ⌋ <b>{}<i> Пожал(а) руку </i>{}</b>',
            '⌈ 🤝 ⌋ <b>{}<i> Крепко пожал(а) руку, выражая уважение </i>{}</b>',
            '⌈ 🤝 ⌋ <b>{}<i> Искренне пожал(а) руку, выражая благодарность </i>{}</b>',
        ],
        'пнуть': [
            '⌈ 😤 ⌋ <b>{}<i> Пнул(а) </i>{}</b>',
            '⌈ 👟 ⌋ <b>{}<i> Легонько пнул(а) </i>{}</b>',
            '⌈ 🤕 ⌋ <b>{}<i>  Со всего размаху пнула(а) по заднице </i>{}</b>',
            '⌈ 💥 ⌋ <b>{}<i>  С силой пнул(а), не скрывая раздражения на </i>{}</b>',
        ],
        'надругаться': [
            '⌈ 😡 ⌋ <b>{}<i> Надругался(-ась) над </i>{}</b>',
            '⌈ 👹 ⌋ <b>{}<i> Жестоко надругался(-ась) </i>{}</b>',
            '⌈ 💀 ⌋ <b>{}<i> Безжалостно надругался(-ась) </i>{}</b>',
        ],
        'потрогать': [
            '⌈ 👋 ⌋ <b>{}<i> Аккуратно потрогал(-а) </i>{}</b>',
            '⌈ 🤲 ⌋ <b>{}<i> Нежно потрогал(-а) </i>{}</b>',
            '⌈ ✨ ⌋ <b>{}<i> Ласково потрогал(-а) </i>{}</b>',
            '⌈ 🌫️ ⌋ <b>{}<i> Едва уловимо потрогал(-а) </i>{}</b>',
            '⌈ 🌸 ⌋ <b>{}<i> Трепетно потрогал(-а) </i>{}</b>',
        ],
        'застрелить': [
            '⌈ 🔫 ⌋ <b>{}<i> Хладнокровно застрелил(-а) </i>{}</b>',
            '⌈ ❄️ ⌋ <b>{}<i> С холодным выражением лица застрелил </i>{}</b>',
            '⌈ 💥 ⌋ <b>{}<i> Без колебаний застрелил </i>{}</b>',
        ],
        'ударить': [
            '⌈ 👊 ⌋ <b>{}<i> Мощно ударил(-а) </i>{}</b>',
            '⌈ 🤛 ⌋ <b>{}<i> Жестоко ударил(-а) </i>{}</b>',
            '⌈ 😡 ⌋ <b>{}<i> Ударил(-а) с огромной яростью </i>{}</b>',
        ],
        'шлепнуть': [
            '⌈ 🍑 ⌋ <b>{}<i> Слегка шлёпнул(-а) </i>{}</b>',
            '⌈ 🖐️ ⌋ <b>{}<i> С легким щелчком, шлёпнул(-а) </i>{}</b>',
            '⌈ 👋 ⌋ <b>{}<i> Мягким движением шлёпнул(-а) по ляжке, оставив лёгкий отпечаток </i>{}</b>',
        ],
        'шлеп': [
            '⌈ 🍑 ⌋ <b>{}<i> Слегка шлёпнул(-а) </i>{}</b>',
            '⌈ 🖐️ ⌋ <b>{}<i> С легким щелчком, шлёпнул(-а) </i>{}</b>',
            '⌈ 👋 ⌋ <b>{}<i> Мягким движением шлёпнул(-а) по ляжке, оставив лёгкий отпечаток </i>{}</b>',
        ],
        'чай': [
            '⌈ ☕️ ⌋ <b>{}<i> Выпил чая с </i>{}</b>',
            '⌈ 🫖 ⌋ <b>{}<i> Пригласил(-а) на душевное чаепитие </i>{}</b>',
            '⌈ ☕️ ⌋ <b>{}<i> Угостил(-а) ароматным чаем </i>{}</b>',
        ],
        'засосать': [
            '⌈ ♥️ ⌋ <b>{}<i> Засосал(-а) </i>{}</b>',
            '⌈ 💖 ⌋ <b>{}<i> В порыве страсти засосал(-а) </i>{}</b>',
            '⌈ 💋 ⌋ <b>{}<i> Притянув к себе, и со страстью поцеловал(-а) </i>{}</b>',
        ],
        'уебать': [
            '⌈ 🤕 ⌋ <b>{}<i> уебал(а) </i>{}</b>',
            '⌈ 🤕 ⌋ <b>{}<i> уебал(а) со всей силы </i>{}</b>',
            '⌈ 😵‍💫 ⌋ <b>{}<i> размахивается и смачно уебывает </i>{}</b>',
            '⌈ 😵‍💫 ⌋ <b>{}<i> подходит и с ноги уебал(а) </i>{}</b>',
        ]
    },
    'notes': {
        'add_note': '%(note_ico)s Заметка с названием «{}» добавлена' % \
            {'note_ico': Notes.note},
        
        'note_not_found': '%(note_ico)s такой заметки нет' % \
            {'note_ico': Notes.note},
        
        'note_already_exist': '%(note_ico)s Заметка с таким названием уже сущевствует.' % \
            {'note_ico': Notes.note},
        
        'show_note': tw.dedent("""
            %(note_ico)s <b>Заметка:</b> <i>«{}»</i>
            
            {}
            """) % \
                {'created_ico': Notes.created, 'note_ico': Notes.note},
        
        'show_notes_not': tw.dedent("""
            <i>«Ой, здесь пока пусто... желаете добавить заметку?»</i>
            
            <blockquote><b>Чтобы добавить первую заметку, напишите:</b>
            <i>+заметка «название»</i>
            В следующей строке напишите текст заметки.</blockquote>
            
            %(note_msg_ico)s Пересланное сообщение тоже можно сохранить как заметку!
            """) % \
                {'note_msg_ico': Notes.note_msg_ico},
        
        'show_notes': tw.dedent("""
            %(notes_ico)s <b>Заметки беседы:</b>
            <blockquote>{}</blockquote>
            
            %(note_ico)s <b>Чтобы открыть заметку, используйте команду:</b>
            «Заметка (номер или название)»
            """) % \
                {'note_ico': Notes.note, 'notes_ico': Notes.notes},
        
        'del_note': '%(note_ico)s Заметка с названием «{}» удалена' % \
            {'note_ico': Notes.note},
        
        'note_not_has_text': '%(memo_ico)s Заметка не содержит текст' % \
            {'memo_ico': OtherIco.memo}
        
    },

    'marry': {
        'marry_ask': tw.dedent("""
            <i>«Судьба свела два сердца… но, каков будет итог?»</i>
            
            <b>💞⌈ {}, признаётся в чувствах, предлагая Вам свою руку и сердце!
            💞⌊ {}, что ты решишь?</b>
            
            —> <b>Принять решение можно командами:</b>
            «<code>Согласиться</code>» | «<code>Отказаться</code>»
            """),
        'marry_comeback_ask': '%(colco_ico)s {}, минуточку внимания.\n%(accept_ico)s {} предлагает вам вернуть ваши отношения.\n Принять решение можно кнопками "Вернуть" / "Отказаться"'% \
            {'colco_ico': Marryico.colco, 'accept_ico': Marryico.accept},
        'confirm_accept_button': '%(accept_ico)sСогласиться' % \
            {'accept_ico': Marryico.accept},
        'user_not_found': '%(memo_ico)s Нет информации о пользователе' % \
            {'memo_ico': Marryico.memo},
        'marry_none': '%(memo_ico)s Нет информации о браке' % \
            {'memo_ico': Marryico.memo},
        'nocomfirm_accept_button': '%(broken_ico)sОтказаться'  % \
            {'broken_ico': Marryico.broken_hear},
        'about_marry_button': 'Подробнее',
        'devorce_marry_button': '%(broken_ico)s Подтвердить' % \
            {'broken_ico': Marryico.broken_hear},
        'confirm_comeback_button': '%(accept_ico)s Вернуть' % \
            {'accept_ico': Marryico.accept},
        'nocomfirm_comeback_button': '%(broken_ico)sОтказаться'  % \
            {'broken_ico': Marryico.broken_hear},
        'nodevorce_marry_button': '%(accept_ico)s Отменить' % \
            {'accept_ico': Marryico.accept},
        'nomarry_devorce': '%(accept_ico)s {}, {}!\nЯ очень рад что вы смогли сохранить свои отношения!' % \
            {'accept_ico': Marryico.accept},
        'devorce_button': '%(memo_ico)s Чтобы развестись, нажмите на кнопку подтверждения' % \
            {'memo_ico': Marryico.memo},
        'noaccept_marry': '%(broken_ico)s {}, примите сожаления\n{} отклонил ваше предложение о вступлении в брак'  % \
            {'broken_ico': Marryico.broken_hear},
        'accept_marry': tw.dedent("""
            <b>%(colco_ico)s {} принимает предложение о браке. Сладко!</b>
            <blockquote>« 💘 {} и {} 💝 соединили свои судьбы священными узами брака »</blockquote>
            Поздравляем с этим радостным событием! Пусть в вашем браке будет больше любви и счастья! Ждём свадебные фотки и приглашения на тост. 💞
            """) % {'colco_ico': Marryico.colco},
        'noaccept_marry_restore': '%(broken_ico)s {}, примите сожаления\n{} отклонил ваше предложение о восстановлении брака'  % \
            {'broken_ico': Marryico.broken_hear},
        'accept_marry_restore': '%(colco_ico)s {} принял предложение о возврате отношений.\n %(marry_ico)s С сегодняшнего дня {} и {} вновь состоят в браке\n\n%(heart_ico)sПартнер считает,что ваш развод был огромной ошибкой и хочет востановить отношения'  % \
            {'colco_ico': Marryico.colco, 'marry_ico': Marryico.marry, 'heart_ico': Marryico.accept},
        'marriage_not_found': '%(memo_ico)s Вы не состоите в браке'  % \
            {'memo_ico': Marryico.memo},
        'marry_not_found': '%(memo_ico)s Пользователь пока не состоит в браке'  % \
            {'memo_ico': Marryico.memo},
        'chat_marriages': tw.dedent("""
            <b>💕 В этом чате уже есть счастливые пары!</b>
            
            <blockquote>{}</blockquote>
            
            <b>%(colco_ico)s Хотите пополнить этот список? 
            Введите команду:</b> «Брак @юзер» 
            <i>Надеюсь, вы сможете найти свою идеальную пару, и ваш брак будет выделяться на фоне остальных, наполненный любовью, взаимным уважением и счастьем! 💖</i>
            """) % {'colco_ico': Marryico.colco},
        'chat_marry_not_found': '%(colco_ico)s В этой беседе ещё не зарегистрировано ни одного брака.\n\n%(chat_ico)s Чтобы вступить в брак с участником беседы, введите команду брак @юзер'  % \
            {'colco_ico': Marryico.colco, 'chat_ico': Marryico.chat},
        'marriage_info': tw.dedent("""
            <b>«Информация о браке»
            —————————</b>
            <b>❤️Регистратор:</b> Epidemic 
            <b>—————————</b>
            «Пара полна надежд и мечт, решив объединить свои сердца в долгом и счастливом союзе. Эта дата навсегда останется в их памяти как день, когда они стали не просто партнерами, но и супругами, готовыми поддерживать друг друга в любой ситуации.»
            
            🩷— <b>{}</b> —&gt💞&lt— <b>{}</b> —🩷
            
            <blockquote>┌  Дата регистрации: {}
            ├  Длительность: {}
            └  Статус: {}</blockquote>
            
            <b>%(love_message_ico)s Первое сообщение при регистрации брака:</b>
            «Пусто...»
            """) % {'love_message_ico': Marryico.con},
        'marry_devorce': tw.dedent("""
            <i>«💔 Брак расторгнут...»</i>
            
            <blockquote>┌<b>{} Подал(а) на развод с {}</b>
            ├ <b> Дата развода:</b> {}
            └ <b>В браке были:</b> {}</blockquote>
            
            {}
            """),
        'not_user_button': 'Отставить жмякать чужие кнопки!',
        'marry_user_another': tw.dedent("""
            <i>«Увы, но кто-то из вас уже нашел счастье в браке...»</i>
            
            ❤️ Возможно, кто-то из вас уже вступил в долгожданный союз, где сердца бьются в унисон, и каждый день наполнен любовью и заботой. В то время как некоторые ещё ищут свою половинку, просим Вас пересмотреть взгляды. Не разлучайте уже соединившиеся сердца! 😥
            """),
        'last_devorce': '%(broken_ico)s {}, {}!\nВаш брак окончательно расторгнут.\n\nПусть вы оба обретете мир, счастье и удовлетворение в предстоящие дни. Пусть у вас хватит сил преодолеть любые трудности, которые встретятся на вашем пути, и смелости принять новые возможности с открытым сердцем.' % \
            {'broken_ico': Marryico.broken_hear},
        'user_marry_user': '%(broken_ico)s Дорогой {}...\nЯ тоже себя люблю.' % \
            {'broken_ico': Marryico.broken_hear},
        'new_marriage_comment': '%(complete_ico)s Описание брака {} и {} успешно обновлено на «{}»' % \
            {'complete_ico': OtherIco.complete},
        'comback_not_found': '%(memo_ico)s  К сожалению, восстановление брака {} и {} не найдено или невозможно'  % \
            {'memo_ico' : OtherIco.memo},
        'marriage_description_is_not_avallible': '%(memo_ico)s Текст описания брака отсутствует' % \
            {'memo_ico' : OtherIco.memo},
        'marriage_description_is_not_avallible_len': '%(memo_ico)s Текст описания брака не соответсвует обьему. Он должен содержать от <i>5</i> до <i>140</i> символов' % \
            {'memo_ico' : OtherIco.memo},    
        'marriage_top_sms': '%(top_ico)s <b>Топ браков этого чата по сообщениям</b>\n{}\n\nЧтобы попасть в топ нужно вступить в брак и писать сообщения состоя в нем' % \
            {'top_ico' : OtherIco.top},
        'marriage_top_exp': '%(top_ico)s <b>Топ браков этого чата по био-опыту</b>\n{}\n\nЧтобы попасть в топ нужно вступить в брак и писать сообщения состоя в нем' % \
            {'top_ico' : OtherIco.top},
        'devorce_if_one_left': '%(broken_ico)s {} сожалеем, но ваш партнер {} вышел из чата, ваш брак расторжен.\n\n%(time_ico)s У вас есть 3 дня на обсуждение и примирение командой «<code>.восстановить брак</code>». Если за это время вы не договоритесь брак будет расторгнут навсегда и не будет подлежать востановлению' % \
            {'broken_ico': Marryico.broken_hear, 'time_ico': Marryico.time},
        'close_button': 'Закрыть',
        'marriage_sms_top_button': '%(con_ico)s Сообщения' % \
            {'con_ico': Marryico.con},
        'marriage_exp_top_button': '%(exp_ico)s Био-опыт' % \
            {'exp_ico': LabIco.bio_experience.value},
        'marriages_button': '%(colco_ico)s Браки' % \
            {'colco_ico': Marryico.colco},
        'next': '%(next_ico)s'% \
            {'next_ico': Marryico.next},
        'prev': '%(prev_ico)s'% \
            {'prev_ico': Marryico.prev},
        'next_time_poem': 'Составьте любовный стих через {}'
    },
    'wedding_anniversaries': {
        1: "бумажная свадьба",
        2: "кожаная свадьба",
        3: "льняная свадьба",
        4: "деревянная свадьба",
        5: "чугунная свадьба",
        6: "медная свадьба",
        7: "жестяная свадьба",
        8: "фаянсовая свадьба",
        9: "оловянная (янтарная) свадьба",
        10: "стальная свадьба",
        11: "никелевая свадьба",
        12: "кружевная (шерстяная) свадьба",
        13: "агатовая свадьба",
        14: "стеклянная свадьба",
        15: "фарфоровая свадьба",
        16: "серебряная свадьба",
        17: "жемчужная свадьба",
        18: "полотняная (льняная, коралловая) свадьба",
        19: "рубиновая свадьба",
        20: "сапфировая свадьба",
        21: "золотая свадьба",
        22: "изумрудная свадьба",
        23: "бриллиантовая (платиновая) свадьба",
        24: "железная свадьба",
        25: "благодатная свадьба",
        26: "коронная свадьба",
        27: "бедроковая свадьба"
    },

    'max': {
        
        'time': {
            'del_marriage_delay': 90
        }
    },

    'get_id': {
        'result_id': '🌀 Генетический код <code>@{}</code> игрока «<b>{}</b>»',
        
        'result_not_found': '%(memo_ico)s Пользователь не найден' % \
            {'memo_ico': OtherIco.memo},
        'get_chat_id': '%(id_ico)s беседы <b>«{}»</b> равен <code>@{}</code>' % \
            {'id_ico': OtherIco.id},
    },

    'rules': {
        'not_admin': '%(memo_ico)s Вы не являетесь администратором чата <i><b>«{}»</b></i>' % \
            {'memo_ico': OtherIco.memo},
        
        'rules_not_found': '%(memo_ico)s Правила для чата <i><b>«{}»</b></i> не найдены' % \
            {'memo_ico': OtherIco.memo},

        'rules_added': '%(complete_ico)s Правила для чата <i><b>«{}»</b></i> были успешно обновлены' % \
            {'complete_ico': OtherIco.complete},

        'rules_del': '%(complete_ico)s Правила для чата <i><b>«{}»</b></i> были успешно удалены' % \
            {'complete_ico': OtherIco.complete},

        'show_rules': '%(memo_ico)s Правила для чата <i><b>«{}»</b></i>\n\n{}' % \
            {'memo_ico': OtherIco.memo},

        'rules_short': '%(memo_ico)s Данный обьем правил не соответсвует обьему. Он должен содержать от <i>5</i> символов' % \
            {'memo_ico' : OtherIco.memo},    

    },

    'chat_members': {
        'new_members_include': '%(complete_ico)s Приветсвия вступления новых участников чата <b>«{}»</b> включены' % \
            {'complete_ico': OtherIco.complete},

        'new_members_off': '%(complete_ico)s Приветсвия вступления новых участников чата <b>«{}»</b> выключены' % \
            {'complete_ico': OtherIco.complete},

        'leave_members_off': '%(complete_ico)s Прощания участников чата <b>«{}»</b> выключены' % \
            {'complete_ico': OtherIco.complete},

        'leave_members_include': '%(complete_ico)s Прощания участников чата <b>«{}»</b> включены' % \
            {'complete_ico': OtherIco.complete},
    },

    'admins': {
        'admin_list': '%(admin_ico)s <b>Список администраторов этого чата</b>\n{}' %\
            {'admin_ico': OtherIco.admin},
        'admins_not_found': '%(memo_ico)s Информация об администраторах не найдена' %\
            {'memo_ico': OtherIco.memo},
    },

    'shiper': {
        'para_chosed': tw.dedent("""
            
            <i>«Только посмотрите на этих очаровашек. Теперь все очевидно, они идеальная пара!»</i>
            
            <blockquote>💖 — « {} + {} » — 💘</blockquote>
            
            <b>Вы только гляньте! Любовь в чистом виде!</b>
            💠 В честь <i>«Вас двух очаровашек»</i> дарим обеим милашкам <b>+15</b> примогемов бонусом
            """),
        
        'para_alredy_chosed': tw.dedent("""
            <i>«Идеальная пара очаровашек уже выбрана»</i>
            
            <blockquote>💖 — « {} + {} » — 💘</blockquote>
            
            %(time_ico)s Следующий выбор будет доступен через <i>{}</i>
            """) % {'time_ico': Marryico.time},
        
        'error_found': '%(memo_ico)s Не могу найти подходящую пару' %\
            {'memo_ico': Marryico.memo}
    },
    
    'chat_update': {
        'join_chat': '',
        'leave_chat': 'До скорого, путник <b>{}</b> Надеюсь, звёзды вновь сведут нас!',
        'bot_join_chat': 'Рада присутствовать в вашем прекрасном чате, надеюсь он засияет новыми красками с приключенским ботом <b>{}</b> 💚'
    },

    'nickname': {
        'successful_changed': '%(memo_ico)s Ваш чат никнейм был изменен, теперь вы <b>{}</b>.' % \
            {'memo_ico': OtherIco.memo}
    }
}

